Dlubal.RFEM5.LoadDistributionType
Type of line and member distribution.

Dlubal.RFEM5.LoadDistributionType.UnknownLoadDistributionType
Unknown distribution type

Dlubal.RFEM5.LoadDistributionType.ConcentratedType
Concentrated load distribution - Q

Dlubal.RFEM5.LoadDistributionType.ConcentratedNxQType
Concentrated load distribution - n x Q

Dlubal.RFEM5.LoadDistributionType.Concentrated2x2QType
Concentrated load distribution - 2 x 2Q

Dlubal.RFEM5.LoadDistributionType.Concentrated2xQType
Concentrated load distribution - 2 x Q

Dlubal.RFEM5.LoadDistributionType.ConcentratedUserDefinedType
Concentrated load distribution - user-defined

Dlubal.RFEM5.LoadDistributionType.UniformType
Uniform load distribution

Dlubal.RFEM5.LoadDistributionType.TrapezoidalType
Trapezoidal load distribution

Dlubal.RFEM5.LoadDistributionType.TaperedType
Tapered load distribution

Dlubal.RFEM5.LoadDistributionType.ParabolicType
Parabolic load distribution

Dlubal.RFEM5.LoadDistributionType.VaryingType
Varying load distribution

Dlubal.RFEM5.LoadDistributionType.LinearType
Linear load distribution

Dlubal.RFEM5.LoadDistributionType.LinearXType
Linear load distribution in X-axis

Dlubal.RFEM5.LoadDistributionType.LinearYType
Linear load distribution in Y-axis

Dlubal.RFEM5.LoadDistributionType.LinearZType
Linear load distribution in Z-axis

Dlubal.RFEM5.LoadDistributionType.RadialType
Radial load distribution